In [1]:
import pandas as pd

# Membaca Dataset

In [2]:
df = pd.read_csv("Top 2000 Universities of the World - Sheet1.csv")

##  Dictionary

In [3]:
info = {
    "Record" : df.shape[0],
    "Attribute" : df.columns.values,
    "Jum Attribute Objek" : df.select_dtypes(["object"]).columns,
    "Jum Attribute Angka" : df.select_dtypes(["float64","int64"]).columns,
    "Jum Attribute Null" : df.loc[:, df.isnull().any()].columns,
}

### Jumlah record,Nama attribute,Jumlah attribute dengan tipe objek,Jumlah attribute dengan tipe angka, Jumlah attribute yang memiliki nilai null.

In [4]:
print(" Record = ", info['Record'])
print("\nAttribute = ", info['Attribute'])
print("\nJumlah Attribute Objek = ", len(info['Jum Attribute Objek']))
print("\nJumlah Attribute Angka = ", len(info['Jum Attribute Angka']))
print("\nJumlah Attribute Null = ", len(info['Jum Attribute Null']))

 Record =  2000

Attribute =  ['World Rank' 'Institution' 'Country' 'National Rank'
 'Quality of Education Rank' 'Alumni Employment Rank'
 'Quality of Faculty Rank' 'Research Performance Rank' 'Score']

Jumlah Attribute Objek =  6

Jumlah Attribute Angka =  3

Jumlah Attribute Null =  0

## Rata-rata, Standar deviasi, Nilai minimum, Nilai maksimum, Q1, Q2, dan Q3

In [5]:
df.describe()

        World Rank  National Rank        Score
count  2000.000000    2000.000000  2000.000000
mean   1000.500000      67.523000    71.586450
std     577.494589      83.128615     5.079795
min       1.000000       1.000000    65.700000
25%     500.750000      10.000000    67.700000
50%    1000.500000      33.000000    70.200000
75%    1500.250000      86.000000    74.100000
max    2000.000000     347.000000   100.000000

## korelasi

In [6]:
df.corr()

               World Rank  National Rank     Score
World Rank        1.00000       0.344200 -0.916950
National Rank     0.34420       1.000000 -0.329112
Score            -0.91695      -0.329112  1.000000

## Nilai Int Menjadi Float

In [7]:
df.select_dtypes(["int64"])*0.001

      World Rank  National Rank
0          0.001          0.001
1          0.002          0.002
2          0.003          0.003
3          0.004          0.001
4          0.005          0.002
...          ...            ...
1995       1.996          0.056
1996       1.997          0.275
1997       1.998          0.276
1998       1.999          0.053
1999       2.000          0.277

[2000 rows x 2 columns]

## Nilai Float Menjadi Int

In [8]:
df.select_dtypes(["float64"])*1000

         Score
0     100000.0
1      96700.0
2      95100.0
3      94100.0
4      93300.0
...        ...
1995   65800.0
1996   65700.0
1997   65700.0
1998   65700.0
1999   65700.0

[2000 rows x 1 columns]

## 10 Record pertama attribute bertipe angka.

In [9]:
Record_angka=df.select_dtypes(["float64","int64"])
Record_angka.head(10)

   World Rank  National Rank  Score
0           1              1  100.0
1           2              2   96.7
2           3              3   95.1
3           4              1   94.1
4           5              2   93.3
5           6              4   92.6
6           7              5   92.0
7           8              6   91.5
8           9              7   91.1
9          10              8   90.7

## Simpan dataset dengan attribute bertipe angka

In [ ]:
df.select_dtypes(["float64","int64"]).to_csv("Angka.csv")